In [1]:
import pandas as pd
from pandas.io import sql
import pyodbc

import numpy as np
from sqlalchemy import create_engine
from sqlalchemy import Table, Column, Integer, String, MetaData, Float, REAL

import matplotlib.pyplot as plt


from plotly import express as px
import seaborn as sns
sns.set(rc={'figure.figsize':(25,5)})

## Database container

### network

`docker network create  default_network`

### timescaledb

```
docker run \
    -p 5432:5432 \
    --name pg_orange \
    -e POSTGRES_PASSWORD=mysecretpa \
    -e POSTGRES_DB=orange3 \
    -e POSTGRES_USER=admin \
    --hostname pg_orange \
    --network default_network \
    --restart unless-stopped \
    -d timescale/timescaledb:latest-pg15
```

### MsSQL

```
docker run \
    -p 1433:1433 \
    --name mssql_orange \
    -e SA_PASSWORD=sqlServerPassw0rd \
    -e ACCEPT_EULA=Y \
    --hostname mssql_orange \
    --network default_network \
    --restart unless-stopped \
    -d mcr.microsoft.com/mssql/server:2017-latest
```

### Adminer

```
docker run \
    -p 8080:8080 \
    --name adminer \
    --network default_network \
    --restart unless-stopped \
    -d adminer
```

In [11]:
979019 - 39220

939799

In [10]:
n_rows = (10**6)+100
# n_rows = 10
n_cols = 1
'{:,}, {:,}'.format(n_rows, n_cols)

'1,000,100, 1'

In [3]:
%%time
matr = (np.ones((n_rows, n_cols)) * np.arange(n_rows).reshape((n_rows, 1))).astype(int)
df =pd.DataFrame(matr)
df

CPU times: user 8.55 ms, sys: 0 ns, total: 8.55 ms
Wall time: 7.07 ms

             0
0            0
1            1
2            2
3            3
4            4
...        ...
999895  999895
999896  999896
999897  999897
999898  999898
999899  999899

[999900 rows x 1 columns]

In [5]:
pg_engine = create_engine('postgresql://admin:mysecretpa@pg_orange:5432/orange3')
mssql_engine = create_engine(
    'mssql+pyodbc://SA:sqlServerPassw0rd@mssql_orange:1433/orange3?driver=/opt/microsoft/msodbcsql17/lib64/libmsodbcsql-17.10.so.2.1',
)

engine = mssql_engine

tab_name = f'data_{n_rows}_{n_cols}'
tab_name

'data_999900_1'

In [6]:
for engine in (pg_engine, mssql_engine):
    sql.execute('DROP TABLE IF EXISTS %s'%tab_name, engine)
    df.to_sql(tab_name, con=engine, if_exists='replace',)

In [7]:
tab_name

'data_999900_1'

In [8]:
pd.read_sql_table(
    tab_name,
    con=pg_engine
)

         index       0
0            0       0
1            1       1
2            2       2
3            3       3
4            4       4
...        ...     ...
999895  999895  999895
999896  999896  999896
999897  999897  999897
999898  999898  999898
999899  999899  999899

[999900 rows x 2 columns]

In [9]:
pd.read_sql_table(
    tab_name,
    con=mssql_engine
)

         index       0
0            0       0
1            1       1
2            2       2
3            3       3
4            4       4
...        ...     ...
999895  999895  999895
999896  999896  999896
999897  999897  999897
999898  999898  999898
999899  999899  999899

[999900 rows x 2 columns]